{
  "project": "Novel-Engine-Refactor",
  "branchName": "feat/domain-and-fortification", 
  "description": "DEEP REFACTORING PHASE. No new features. Focus on code quality, UI/UX cleanup, and End-to-End wiring on the CURRENT branch.",
  "userStories": [
    {
      "id": "REF-001",
      "title": "Frontend Architecture & UX Overhaul",
      "description": "Refactor the Weaver frontend to match Vibe Coding best practices. The code is currently messy.",
      "acceptanceCriteria": [
        "Refactor `WeaverPage.tsx`: Split into smaller, semantic components (Toolbar, Canvas, Sidebar).",
        "UI Polish: Ensure the node creation/connection animation is smooth (No flickering).",
        "Type Safety: Replace any `any` types in frontend hooks with generated types from `src/lib/api/generated/api-types.ts`.",
        "Comments: Add JSDoc comments to all Hooks explaining complex logic (Optimistic UI)."
      ],
      "priority": 1,
      "passes": true,
      "notes": "DO NOT CREATE NEW BRANCH. Modify existing files in place. Make the UI look professional."
    },
    {
      "id": "REF-002",
      "title": "Backend Code Quality & Docs",
      "description": "The backend works but lacks readability. Harded the codebase.",
      "acceptanceCriteria": [
        "Add Python Docstrings (Google Style) to all Domain Entities and Services in `src/contexts/world`.",
        "Refactor `LLMWorldGenerator`: Extract the retry logic into a reusable Decorator or Mixin if it's too coupled.",
        "Cleanup: Remove any unused imports or commented-out code detected by linter."
      ],
      "priority": 2,
      "passes": true,
      "notes": "Treat this as if you are preparing for a strict code review."
    },
    {
      "id": "INT-001",
      "title": "End-to-End wiring Check",
      "description": "Verify the system actually runs from UI to DB.",
      "acceptanceCriteria": [
        "Manual Verification Script: Create `scripts/verify_e2e.py` that calls the API and checks the output, printing the generated World graph.",
        "Ensure frontend API client correctly handles the specific error format from backend (Validation Errors)."
      ],
      "priority": 3,
      "passes": true,
      "notes": "Ensure the novel generation actually outputs content."
    }
  ]
}